In [1]:
import pandas as pd

In [11]:
ratings = pd.read_csv('dataset/ml-1m/ratings.csv', header=None)

In [12]:
ratings.shape

(1000209, 4)

In [13]:
ratings.head()

   0     1  2          3
0  1  1193  5  978300760
1  1   661  3  978302109
2  1   914  3  978301968
3  1  3408  4  978300275
4  1  2355  5  978824291

In [14]:
col_names = ['user_id','movie_id','rating','time stamp']
ratings.columns = col_names

In [15]:
ratings.head()

   user_id  movie_id  rating  time stamp
0        1      1193       5   978300760
1        1       661       3   978302109
2        1       914       3   978301968
3        1      3408       4   978300275
4        1      2355       5   978824291

In [17]:
movies = pd.read_csv('dataset/ml-1m/movies.dat', sep='::', header = None)

C:\Users\asus\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [18]:
movies.head()

   0                                   1                             2
0  1                    Toy Story (1995)   Animation|Children's|Comedy
1  2                      Jumanji (1995)  Adventure|Children's|Fantasy
2  3             Grumpier Old Men (1995)                Comedy|Romance
3  4            Waiting to Exhale (1995)                  Comedy|Drama
4  5  Father of the Bride Part II (1995)                        Comedy

In [19]:
col_names = ['movie_id', 'movie_name', 'genre']
movies.columns = col_names

In [20]:
movies.head()

   movie_id                          movie_name                         genre
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [22]:
top_rated_user_1 = ratings[(ratings['user_id'] == 1) & (ratings['rating'] == 5)]

In [23]:
top_rated_user_1.head()

    user_id  movie_id  rating  time stamp
0         1      1193       5   978300760
4         1      2355       5   978824291
6         1      1287       5   978302039
7         1      2804       5   978300719
10        1       595       5   978824268

In [29]:
movies['movie_id'][1]

2

In [39]:
top_rated_user_1.reset_index(inplace=True)

In [48]:
top_rated_user_1.drop('index', inplace=True, axis=1)

C:\Users\asus\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [49]:
top_rated_user_1

    user_id  movie_id  rating  time stamp
0         1      1193       5   978300760
1         1      2355       5   978824291
2         1      1287       5   978302039
3         1      2804       5   978300719
4         1       595       5   978824268
5         1      1035       5   978301753
6         1      3105       5   978301713
7         1      1270       5   978300055
8         1       527       5   978824195
9         1        48       5   978824351
10        1      1836       5   978300172
11        1      1022       5   978300055
12        1       150       5   978301777
13        1         1       5   978824268
14        1      1961       5   978301590
15        1      1028       5   978301777
16        1      1029       5   978302205
17        1      2028       5   978301619

In [43]:
movies[movies['movie_id'] == top_rated_user_1['movie_id'][2]]

      movie_id      movie_name                   genre
1267      1287  Ben-Hur (1959)  Action|Adventure|Drama

In [69]:
new_df = []
for m_id in top_rated_user_1['movie_id']:
    print(movies[movies['movie_id'] == m_id])
#     new_df.append(movies[movies['movie_id'] == m_id])

      movie_id                              movie_name  genre
1176      1193  One Flew Over the Cuckoo's Nest (1975)  Drama
      movie_id            movie_name                        genre
2286      2355  Bug's Life, A (1998)  Animation|Children's|Comedy
      movie_id      movie_name                   genre
1267      1287  Ben-Hur (1959)  Action|Adventure|Drama
      movie_id                 movie_name         genre
2735      2804  Christmas Story, A (1983)  Comedy|Drama
     movie_id                   movie_name                         genre
591       595  Beauty and the Beast (1991)  Animation|Children's|Musical
      movie_id                  movie_name    genre
1022      1035  Sound of Music, The (1965)  Musical
      movie_id         movie_name  genre
3036      3105  Awakenings (1990)  Drama
      movie_id                 movie_name          genre
1250      1270  Back to the Future (1985)  Comedy|Sci-Fi
     movie_id               movie_name      genre
523       527  Schindler's List (1993)  Drama|War
    movie_id         movie_name                                 genre
47        48  Pocahontas (1995)  Animation|Children's|Musical|Romance
      movie_id                      movie_name  genre
1768      1836  Last Days of Disco, The (1998)  Drama
      movie_id         movie_name                         genre
1009      1022  Cinderella (1950)  Animation|Children's|Musical
     movie_id        movie_name  genre
148       150  Apollo 13 (1995)  Drama
   movie_id        movie_name                        genre
0         1  Toy Story (1995)  Animation|Children's|Comedy
      movie_id       movie_name  genre
1892      1961  Rain Man (1988)  Drama
      movie_id           movie_name                      genre
1015      1028  Mary Poppins (1964)  Children's|Comedy|Musical
      movie_id    movie_name                         genre
1016      1029  Dumbo (1941)  Animation|Children's|Musical
      movie_id                  movie_name             genre
1959      2028  Saving Private Ryan (1998)  Action|Drama|War

In [77]:
genre = []
for i in range(len(movies['genre'])):
    genre.append(movies['genre'][i].split("|"))

In [79]:
genre_df = pd.DataFrame(genre)

In [81]:
genre_df.head()

           0           1        2     3     4     5
0  Animation  Children's   Comedy  None  None  None
1  Adventure  Children's  Fantasy  None  None  None
2     Comedy     Romance     None  None  None  None
3     Comedy       Drama     None  None  None  None
4     Comedy        None     None  None  None  None

In [82]:
col_names = ['genre_1', 'genre_2', 'genre_3', 'genre_4','genre_5', 'genre_6']
genre_df.columns = col_names

In [83]:
movies.drop('genre', inplace=True, axis=1)

In [89]:
# movies['genre_1'] = genre_df['genre_1']
movies['genre_2'] = genre_df['genre_2']
movies['genre_3'] = genre_df['genre_3']
movies['genre_4'] = genre_df['genre_4']
movies['genre_5'] = genre_df['genre_5']
movies['genre_6'] = genre_df['genre_6']

In [91]:
movies.head()

,movie_id,movie_name,genre_1,genre_2,genre_3,genre_4,genre_5,genre_6
0,1,Toy Story (1995),Animation,Children's,Comedy,None,None,None
1,2,Jumanji (1995),Adventure,Children's,Fantasy,None,None,None
2,3,Grumpier Old Men (1995),Comedy,Romance,None,None,None,None
3,4,Waiting to Exhale (1995),Comedy,Drama,None,None,None,None
4,5,Father of the Bride Part II (1995),Comedy,None,None,None,None,None